import "bootstrap/dist/css/bootstrap.min.css";
import "./App.css";
import { Button, Container, Table } from "react-bootstrap";
import { BrowserRouter, Route, Routes, NavLink } from "react-router-dom";
import Contact from "./contact";
import React, { useRef, useState } from "react";

export function Layout() {
  return (
    <nav className="p-3 mb-2 bg-warning text-white">
      <NavLink
        to="/"
        className="link px-2 "
        style={({ isActive, isPending }) => {
          return {
            textDecoration: isActive ? "none" : "underline",
          };
        }}
      >
        หน้าแรก
      </NavLink>
      <NavLink
        to="/product"
        className="link px-2"
        style={({ isActive, isPending }) => {
          return {
            textDecoration: isActive ? "none" : "underline",
          };
        }}
      >
        ตารางเทียบแคลอรี
      </NavLink>
      <NavLink
        to="/contact"
        className="link px-2"
        style={({ isActive, isPending }) => {
          return {
            textDecoration: isActive ? "none" : "underline",
          };
        }}
      >
        ผู้จัดทํา
      </NavLink>
    </nav>
  );
}

function Overviwe1(){
  return (
    <>
    <Layout />
    <img className = 'center' src="card-01.jpg" alt="Food"/>;
    <h2 className="p2">เมี่ยงคำกลีบบัวหลวงแบบโบราณ</h2>
    <p className = 'p3'>มี่ยงคำกลีบบัวหลวง เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ที่มีความประณีตสวยงาม เป็นต้นตำรับเมนูสมุนไพรของคนไทยโบราณที่มีมาช้านานทั้งในเรื่องของรสชาติที่กลมกล่อม เครื่องปรุงล้วนเป็นสมุนไพรจากธรรมชาติ มีคุณค่าทางสมุนไพรสูง เพราะมีคุณสมบัติในการบำรุงรักษาธาตุทั้ง 4 เพื่อให้สมดุลกัน กลีบบัวหลวง มีสีสันสวยงาม มีสรรพคุณบำรุงร่างกาย ห้ามเลือด มีเส้นใยอาหารสูง และกระตุ้นการขับถ่ายเป็นยาสมานแผล ช่วยบำรุงร่างกายบำรุงหัวใจ ลดความดันโลหิตสูง และลดระดับน้ำตาลในเลือดได้ โดยมีเครื่องเคียงที่มีพืชผักสมุนไพรที่ถูกหั่นออกเป็นชิ้นเล็กๆความความประณีตในการหั่น ซอย เครื่อง หัวหอมแดง ขิง พริก มะนาว ต้องหั่นให้เป็นชิ้นสี่เหลี่ยมลูกเต๋าสวยงาม ถั่วลิสงคั่ว แล้วเรียงเม็ดจัดให้เท่ากัน แถมด้วยความกรุบกรอบของมะพร้าวคั่วที่นำเนื้อมะพร้าวแก่แต่ไม่แข็งจนเกินไป นำมาหั่นบางเท่ากัน ก่อนนำไปอบและคั่วด้วยไฟอ่อนๆจนหอมกรุ่นมะพร้าว เป็นสีเหลืองน้ำตาลอ่อน เมื่อห่อรวมกันเข้าแล้ว ราดด้วยน้ำเมี่ยงคำหวาน เวลารับประทานจะได้รสชาติของสมุนไพรพื้นบ้านทุกคำ จึงมีประโยชน์ต่อสุขภาพสูงมาก ลดอัตราเสี่ยงต่อการเกิดโรค เช่น โรคไขมันในเลือดสูง โรคหัวใจและหลอดเลือด โรคความดันโลหิตสูง โรคเบาหวาน เป็นต้น
ประโยชน์ของสมุนไพรที่มีสรรพคุณต่อสุขภาพ
     มะพร้าวคั่ว เป็นสมุนไพรที่นำเนื้อมะพร้าวแก่แต่ไม่แข็งจนเกินไป นำมาหั่นบางๆ ก่อนนำไปอบและคั่วจนหอมกรุ่นมะพร้าว เป็นสีเหลืองน้ำตาลอ่อน มีสรรพคุณช่วยบำรุงกำลัง บำรุงเส้นเอ็น ใช้รักษาโรคกระดูก อีกทั้งในเนื้อมะพร้าวยังมีกรดไขมันอิ่มตัวและคาร์โบไฮเดรตชนิดดี ที่จะทำให้ช่วยลดระดับไขมันในเส้นเลือดได้
     พริกขี้หนู เป็นสมุนไพรที่มีส่วนช่วยแต่งรสชาติและสีให้อาหารนานาชนิด มีการนำมาใช้ในการประกอบอาหาร เพื่อเพิ่มความเผ็ดทำให้อาหารมีรสชาติที่อร่อยยิ่งขึ้น มีสรรพคุณทำให้ระบบการเผาผลาญทำงานได้ดี ส่งผลให้ สามารถช่วยลดน้ำหนักได้ อีกทั้งพริกยังมีวิตามินซีสูง ที่จะช่วยขยายเส้นเลือดในลำไส้และกระเพาะอาหาร ทำให้ร่างกายดูดซึมสารอาหารได้เป็นอย่างดี และยังมีส่วนช่วยกระตุ้นระบบการขับถ่ายให้ทำงานอย่างเป็นปกติอีกด้วย
     มะนาว เป็นสมุนไพรที่ จัดว่าเป็นได้ทั้งผักและผลไม้ในตัวเดียวกัน เนื้อในของมะนาวอุดมไปด้วยน้ำที่มีรสเปรี้ยว เป็นเครื่องปรุงรสอาหารไทยซึ่งเป็นสัญลักษณ์ที่โดดเด่น ที่มีสรรพคุณทางยา สามารถช่วยลดอาการไอ ขับเสมหะ เนื่องจากในน้ำมะนาวมีกรดอินทรีย์หลายชนิด มีรสเปรี้ยวกระตุ้นให้มีการขับน้ำลาย ทำให้ชุ่มคอ จึงช่วยลดอาการไอได้ มะนาว ยังเป็น สมุนไพรแก้ท้องอืด ท้องเฟ้อ และช่วยในการขับลม ได้เป็นอย่างดี อีกทั้งยังอุดมไปด้วยวิตามินซี ซึ่งช่วย เสริมสร้างระบบภูมิคุ้มกันและป้องกันโรคหวัดได้ดีด้วย
     หอมแดง เป็นสมุนไพรที่มีการนำมาใช้ในการประกอบอาหารที่มีสรรพคุณทางยาสามารถ ขับลมในลำไส้ แก้ปวดท้อง บำรุงธาตุ แก้หวัดคัดจมูก อีกทั้งยังช่วยทำให้ระบบย่อยอาหารดี เจริญอาหาร ทำให้ความดันโลหิตต่ำ ลดไขมันในเลือดได้ดีด้วย
     ถั่วลิสงคั่ว เป็นสมุนไพรที่นำมาใช้เป็นอาหารคือเมล็ด ที่เอาเปลือกนอกออกแล้ว ที่มีการนำมาใช้ในการประกอบอาหารที่มีสรรพคุณทางยา ช่วยลดความดันโลหิตสูง ลดความเสี่ยงของโรคเบาหวาน ช่วยป้องกันโรคหัวใจ เนื่องจากในถั่วลิสงมีสารที่ช่วยลดระดับคอเลสเตอรอล จึงช่วยลดความเสี่ยงของภาวะไขมันอุดตันในเส้นเลือดและภาวะหลอดเลือดแข็งตัว ซึ่งเป็นสาเหตุของการเกิดโรคหัวใจได้
     จึงถือได้ว่า เมี่ยงคำกลีบบัวหลวง เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ ของความเป็นไทย ภายในเมี่ยงหนึ่งคำ ล้วนแฝงไปด้วยความประณีต บรรจง ของเครื่องเคียงที่อยู่ภายใน มีคุณค่าทางโภชนาการ และสรรพคุณทางยาจากพืชผักสมุนไพรพื้นบ้านที่มีประโยชน์นานาชนิด เป็นวัฒนธรรมอาหารที่ควรอนุรักษ์ และยังแสดงออกถึงภูมิปัญญาท้องถิ่น ถือเป็นภูมิปัญญาไทยและมรดกทางวัฒนธรรมอาหารพื้นเมืองที่ต้องรักษาสืบทอดกันต่อไป
</p>

    </>
  );
}

function Overviwe2(){
  return (
    <>
    <Layout />
    <img className = 'center' src="card-05.jpg" alt="Food"/>;
    <h2 className="p2">แกงเห็ดเผาะไข่มดแดง</h2>
    <p className = 'p3'>แกงเห็ดเผาะไข่มดแดง เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น โดยการนำเอาทรัพยากรชีวภาพที่มีอยู่ในท้องถิ่นมาปรุงเป็นอาหารพื้นเมือง ที่มีรสชาติกลมกล่อม เป็นอาหารที่ให้คุณค่าทางโภชนาการ เห็ดเผาะมีโปรตีนและแร่ธาตุต่างๆและสรรพคุณทางยาให้ประโยชน์ช่วยบำรุงร่างกาย ลดอาการร้อนใน เนื่องจากมีฤทธิ์เย็น แก้ช้ำใน แก้ไข้ตัวร้อน ช่วยสมานแผล ลดอาการอักเสบและบวม ช่วยทำให้เลือดแข็งตัวได้เร็วขึ้น บรรเทาอาการคันตามร่างกาย และยังมีส่วนช่วยยับยั้งการเกิดเซลล์มะเร็งอีกด้วย ส่วนไข่มดแดง มีประโยชน์ต่อร่างกายมีคุณค่าทางอาหารสูง โดยเฉพาะโปรตีน ฟอสฟอรัส และแคลเซียม และยังมีสรรพคุณทางยาช่วยระบายท้องและเจริญอาหาร และ ผักหวานเป็น ผักพื้นบ้านสมุนไพร มีคุณค่าทางโภชนาการสูง เป็นแหล่งของโปรตีน วิตามินซี เบต้าแคโรทีนซึ่งช่วยในการมองเห็น บำรุงสายตา และมีสรรพคุณเป็นสารต้านอนุมูลอิสระ ช่วยป้องกันโรคมะเร็ง โรคหัวใจขาดเลือด โรคเบาหวานและ โรคความดันโลหิตสูง มี แคลเซียม และฟอสฟอรัสสูง ช่วยบำรุงกระดูก และฟันให้แข็งแรง และมีเส้นใยอาหารช่วยในการขับถ่ายได้ ซึ่งล้วนแล้วแต่มีประโยชน์ของสมุนไพรที่มีสรรพคุณต่อสุขภาพร่างกายแทบทั้งสิ้น นำเห็ดเผาะ ไข่มดแดง และผักหวานมาแกงผสมผสานเข้ากับน้ำคั้นใบย่านางสีเขียวเข้มที่มีสารต่อต้านอนุมูลอิสระ และมีสรรพคุณ เสริมสร้างภูมิต้านทานโรคในร่างกาย ช่วยขับพิษและลดไข้ ช่วยป้องกันการเกิดโรคหัวใจ ช่วยลดระดับน้ำตาลในเลือด และลดความดันโลหิตสูงได้ ปรุงรสนัวด้วยน้ำปลาร้า เกลือป่น และข้าวคั่วป่นลงไป เติมความเผ็ดด้วยพริกสดสีแดง ที่ช่วยให้ส่วนผสมน้ำแกงรสเผ็ดร้อนเข้มข้นกลมกล่อม กลิ่นหอมจากสมุนไพรสดในเครื่องพริกแกง ได้แก่ ใบแมงลัก ข่า ตะไคร้ ล้วนมีสรรพคุณทางยา มีสารต่อต้านอนุมูลอิสระ ช่วยลดความดันโลหิต ลดไขมันในเลือดได้ดี ยังมีส่วนช่วยกระตุ้นระบบการขับถ่ายให้ทำงานอย่างเป็นปกติอีกด้วย
     จึงถือได้ว่า แกงเห็ดเผาะไข่มดแดง เป็นอาหารพื้นเมือง ที่มีสรรพคุณต่อสุขภาพ ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ ของความเป็นไทย เป็นอาหารที่ใช้วัตถุดิบธรรมชาติที่มีในท้องถิ่นมาปรุงแต่ง และถ่ายทอดภูมิปัญญาอาหารพื้นเมืองมาช้านาน เป็นอาหารแห่งความมีคุณค่าทางโภชนาการ และสรรพคุณทางยาจากพืชผักสมุนไพรพื้นบ้านที่มีประโยชน์นานาชนิด ที่ช่วยเสริมภูมิต้านทานและป้องกันโรค เป็นวัฒนธรรมอาหารที่ควรอนุรักษ์ และยังแสดงออกถึงภูมิปัญญาท้องถิ่น ถือเป็นภูมิปัญญาไทยและมรดกทางวัฒนธรรมอาหารพื้นเมืองที่ต้องรักษาสืบทอดกันต่อไป
</p>

    </>
  );
}

function Overviwe3(){
  return (
    <>
    <Layout />
    <img className = 'center' src="card-09.jpg" alt="Food"/>;
    <h2 className="p2">แกงอ่อมหอยขม</h2>
    <p className = 'p3'> แกงอ่อมหอยขม เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น เป็นแกงอ่อมอาหารพื้นเมืองที่อุดมไปด้วยคุณค่าทางโภชนาการเพราะส่วนประกอบหลักส่วนใหญ่เป็นผักและสมุนไพรพื้นบ้านนานาชนิดเป็นความผสมผสานที่ลงตัวระหว่างชนิดของอาหาร และเครื่องปรุง มีเสน่ห์ของความเป็นไทย ต้นตำรับเมนูสมุนไพรโบราณที่มีมาช้านานของจังหวัดอุบลราชธานี โดยการนำหอยขมหรือหอยจุ๊บที่อยู่ในแหล่งน้ำตามธรรมชาติ มีคุณค่าทางโภชนาการเป็นแหล่งโปรตีน และคอลาเจน ที่มีประโยชน์ต่อร่างกาย มาแกงผสมผสานเข้ากับน้ำคั้นใบย่านางสีเขียวเข้มที่มีสารต่อต้านอนุมูลอิสระ และมีสรรพคุณ เสริมสร้างภูมิต้านทานโรคในร่างกาย ช่วยขับพิษและลดไข้ ช่วยป้องกันการเกิดโรคหัวใจ ช่วยลดระดับน้ำตาลในเลือด และลดความดันโลหิตสูงได้ ยังมีข้าวเบือ คือ การนำข้าวเหนียวมาแช่น้ำไว้อย่างน้อย 1 ชั่วโมงให้เมล็ดข้าวเหนียวอ่อนนุ่ม สงให้สะเด็ดน้ำ แล้วนำมาโขลกให้ละเอียด ไว้ใส่ในแกงอ่อม ที่ช่วยให้ส่วนผสมน้ำแกงรสเผ็ดร้อนเข้มข้นกลมกล่อม ปรุงรสนัวด้วยน้ำปลาร้า เติมความเผ็ดด้วยพริกสด กลิ่นหอมจากสมุนไพรสดในเครื่องพริกแกงอ่อม ได้แก่ ใบแมงลัก ข่า ตะไคร้ หัวหอม กระเทียม ต้นหอม รวมไปถึงกลิ่นหอมของผักชีลาว ซึ่งเป็นเอกลักษณ์ของแกงอ่อมอีสานรวมอยู่ด้วย ล้วนมีสรรพคุณทางยา มีสารต่อต้านอนุมูลอิสระ ช่วยลดความดันโลหิต ลดไขมันในเลือดได้ดี และยังมีส่วนช่วยกระตุ้นระบบการขับถ่ายให้ทำงานอย่างเป็นปกติอีกด้วย และที่ขาดไม่ได้คือ ใบชะพลู นั้นถือได้ว่าเป็นพืชผักพื้นบ้านที่อยู่คู่ครัวและภูมิปัญญาไทย มายาวนาน มีสรรพคุณทางยาที่สำคัญ ช่วยบำรุงธาตุ ขับลม แก้อาการท้องอืดท้องเฟ้อ และช่วยในการขับเสมหะ และช่วยลดระดับน้ำตาลในเลือด เป็นต้น นอกจากนี้ในใบชะพลูยังมีวิตามินเอช่วยบำรุงและรักษาสายตา และมีแคลเซียม ธาตุเหล็ก ธาตุฟอสฟอรัส คลอโรฟิลล์ เส้นใย ซึ่งล้วนแล้วแต่มีประโยชน์ของสมุนไพรที่มีสรรพคุณต่อสุขภาพร่างกายแทบทั้งสิ้น
     จึงถือได้ว่า แกงอ่อมหอยขม เป็นอาหารพื้นเมือง ที่มีสรรพคุณต่อสุขภาพ ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ ของความเป็นไทย ถูกปรุงแต่งและถ่ายทอดสูตรอาหารพื้นเมืองโบราณของจังหวัดอุบลราชธานีมาช้านาน เป็นอาหารแห่งความมีคุณค่าทางโภชนาการ และสรรพคุณทางยาจากพืชผักสมุนไพรพื้นบ้านที่มีประโยชน์นานาชนิด เป็นวัฒนธรรมอาหารที่ควรอนุรักษ์ และยังแสดงออกถึงภูมิปัญญาท้องถิ่น ถือเป็นภูมิปัญญาไทยและมรดกทางวัฒนธรรมอาหารพื้นเมืองที่ต้องรักษาสืบทอดกันต่อไป
</p>

    </>
  );
}

function Index() {
  return (
    <>
      <Layout />
      <p className="p3">
        อาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพตามวิถีภูมิปัญญาท้องถิ่นของจังหวัดอุบลราชธานี
      </p>
      <div className="grid-container">
        <div className="grid-item">
          <img className="img" src="card-01.jpg" alt="Food" />
          <h2 className="p2">เมี่ยงคำกลีบบัวหลวงแบบโบราณ</h2>
          <p className = 'p1'>เมี่ยงคำกลีบบัวหลวง เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี มีความโดดเด่นและมีเอกลักษณ์ที่มีความประณีตสวยงาม เป็นต้นตำรับเมนูสมุนไพรของคนไทยโบราณที่มีมาช้านานทั้งในเรื่องของรสชาติที่กลมกล่อม เครื่องปรุงล้วนเป็นสมุนไพรจากธรรมชาติ มีคุณค่าทางสมุนไพรสูง เพราะมีคุณสมบัติในการบำรุงรักษาธาตุทั้ง 4 เพื่อให้สมดุลกัน กลีบบัวหลวง มีสีสันสวยงาม มีสรรพคุณบำรุงร่างกาย ห้ามเลือด มีเส้นใยอาหารสูง และกระตุ้นการขับถ่ายเป็นยาสมานแผล ช่วยบำรุงร่างกายบำรุงหัวใจ ลดความดันโลหิตสูง และลดระดับน้ำตาลในเลือดได้ </p>
          <Button variant="danger" ><NavLink
        to="/overviwe1"
        className="link px-2 "
        style={({ isActive, isPending }) => {
          return {
            textDecoration: isActive ? "none" : "underline",
          };
        }}
      >
        เรียนรู้เพิ่มเติม
      </NavLink></Button>
        </div>
        <div className="grid-item">
          <img className="img" src="card-05.jpg" alt="Food" />
          <h2 className="p2">แกงเห็ดเผาะไข่มดแดง</h2>
          <p className = 'p1'>แกงเห็ดเผาะไข่มดแดง เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น โดยการนำเอาทรัพยากรชีวภาพที่มีอยู่ในท้องถิ่นมาปรุงเป็นอาหารพื้นเมือง ที่มีรสชาติกลมกล่อม เป็นอาหารที่ให้คุณค่าทางโภชนาการ เห็ดเผาะมีโปรตีนและแร่ธาตุต่างๆและสรรพคุณทางยาให้ประโยชน์ช่วยบำรุงร่างกาย ลดอาการร้อนใน เนื่องจากมีฤทธิ์เย็น แก้ช้ำใน แก้ไข้ตัวร้อน ช่วยสมานแผล ลดอาการอักเสบและบวม ช่วยทำให้เลือดแข็งตัวได้เร็วขึ้น บรรเทาอาการคันตามร่างกาย และยังมีส่วนช่วยยับยั้งการเกิดเซลล์มะเร็งอีกด้วย</p>
          <Button variant="danger" ><NavLink
        to="/overviwe2"
        className="link px-2 "
        style={({ isActive, isPending }) => {
          return {
            textDecoration: isActive ? "none" : "underline",
          };
        }}
      >
        เรียนรู้เพิ่มเติม
      </NavLink></Button>

        </div>
        <div className="grid-item">
          <img className="img" src="card-09.jpg" alt="Food" />
          <h2 className="p2">แกงอ่อมหอยขม</h2>
          <p className = 'p1'>แกงอ่อมหอยขม เป็นอาหารพื้นเมืองที่มีสรรพคุณต่อสุขภาพ ตามวิถีภูมิปัญญาท้องถิ่น ของจังหวัดอุบลราชธานี ที่ได้สืบทอดกันมารุ่นต่อรุ่น เป็นแกงอ่อมอาหารพื้นเมืองที่อุดมไปด้วยคุณค่าทางโภชนาการเพราะส่วนประกอบหลักส่วนใหญ่เป็นผักและสมุนไพรพื้นบ้านนานาชนิดเป็นความผสมผสานที่ลงตัวระหว่างชนิดของอาหาร และเครื่องปรุง มีเสน่ห์ของความเป็นไทย ต้นตำรับเมนูสมุนไพรโบราณที่มีมาช้านานของจังหวัดอุบลราชธานี </p>
          <Button variant="danger" ><NavLink
        to="/overviwe3"
        className="link px-2 "
        style={({ isActive, isPending }) => {
          return {
            textDecoration: isActive ? "none" : "underline",
          };
        }}
      >
        เรียนรู้เพิ่มเติม
      </NavLink></Button>

        </div>
      </div>
    </>
  );
}

function Product() {
  const [totalcalorie, setTotalcalorie] = useState(0);
   const table = useRef();
  const tr = useRef([]);
 

  const data = [
    ["เมี่ยงคำกลีบบัวหลวงแบบโบราณ", 300],
    ["แกงเห็ดเผาะไข่มดแดง", 250],
    ["แกงอ่อมหอยขม", 200]
  ];

  return (
    <>
      <Layout />
      <Table striped bordered hover className="my-3" ref={table}>
        <thead>
          <tr>
            <th>เมนูอาหาร</th>
            <th>พลังงานที่ได้รับ</th>
            <th className="text-center">เลือกเมนู</th>
          </tr>
        </thead>
        <tbody>
          {data.map((item, i) => {
            return (
              <tr
                ref={(el) => {
                  tr.current[i] = el;
                }}
                key={i}
              >
                <td>{item[0]}</td>
                <td>{item[1]}</td>
                <td className="text-center">
                  <Button variant="danger" onClick={() => {
                    setTotalcalorie(totalcalorie + item[1]);
                    }}>
                    เลือกเมนูนี้
                  </Button>
                </td>
              </tr>
            );
          })}
        </tbody>
      </Table>
      <div className = 'p1'>
        พลังงานรวมที่ได้รับ {totalcalorie} Kcal
      </div>
    </>
  );
}

function App() {
  return (
    <BrowserRouter basename="/myfirestweb" >
      <Container className="p-3 my-3 bg-light">
        <Routes>
          <Route path="/" element={<Index />} />
          <Route path="/main" element={<Index />} />
          <Route path="/product" element={<Product />} />
          <Route path="/contact" element={<Contact />} />
          <Route path="/overviwe1" element={<Overviwe1 />} />
          <Route path="/overviwe2" element={<Overviwe2 />} />
          <Route path="/overviwe3" element={<Overviwe3 />} />
        </Routes>
      </Container>
    </BrowserRouter>
  );
}

export default App;
